<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2019/12/17
 * Time: 18:03
 */
namespace App\Http\Controllers;

use App\Http\Controllers\Controller;
use App\Model\About;
use App\Model\Agent;
use App\Model\Asset;
use App\Model\Collection;
use App\Model\Friend;
use App\Model\FriendShip;
use App\Model\Goods;
use App\Model\IncomeDetails;
use App\Model\Order;
use App\Model\User;
use App\Services\AlibabaSms;
use App\Services\CityServices;
use App\Services\CourierBirdService;
use App\Services\MapServices;
use App\Services\WePushService;
use Illuminate\Http\Request;
use Illuminate\Support\Facades\Log;
use Illuminate\Support\Facades\Redis;

class TestController extends Controller{

    private $friend;
    private $user;
    private $agent;
    public function __construct(Friend $friend,User $user,Agent $agent)
    {
        $this->friend = $friend;
        $this->user = $user;
        $this->agent = $agent;
    }


    /**
     * 数组去重
     */
    public static function array_unset_tt($arr,$key){
        //建立一个目标数组
        $res = array();
        foreach ($arr as $value) {
            //查看有没有重复项
            if(isset($res[$value[$key]])){
                unset($value[$key]);  //有：销毁
            }else{
                $res[$value[$key]] = $value;
            }
        }
        return $res;
    }

    public function push(Request $request){



        $id = $request->get('id',1);
        $openID = 'oBNBp5L5SrWjJh6yBfc7q8yfwypg';
        if($id == 1){
            $message_data = [
                'character_string1'=>'123456',
                'thing2'=>'黄酒',
                'thing6'=>'顺丰',
                'character_string7'=>'123456',
                'phrase4'=>'已发送',
            ];
        }elseif($id == 2){
            $message_data = [
                'character_string1'=>'123456',
                'thing2'=>'黄酒 * 1',
                'time3'=>'2020-1-3',
                'name4'=>'龙腾兄',
            ];
        }else{
            $message_data = [
                'name1'=>'张三',
                'phrase2'=>'审核通过',
                'thing3'=>'VIP',
            ];
        }

        $data = WePushService::send_notice($id,$message_data,$openID);
        dd($data);
    }

    public function test(){

        $province = '北京市';
        $city = '市辖区';
        $return = CityServices::getCity($province,$city);
        dd($return);




        $arrays = [
            0=>"北京市",
            1=>"天津市",
            2=>"河北省",
            3=>"山西省",
            4=>"内蒙古自治区",
            5=>"辽宁省",
            6=>"吉林省",
            7=>"黑龙江省",
            8=>"上海市",
            9=>"江苏省",
            10=>"浙江省",
            11=>"安徽省",
            12=>"福建省",
            13=>"江西省",
            14=>"山东省",
            15=>"河南省",
            16=>"湖北省",
            17=>"湖南省",
            18=>"广东省",
            19=>"广西壮族自治区",
            20=>"海南省",
            21=>"重庆市",
            22=>"四川省",
            23=>"贵州省",
            24=>"云南省",
            25=>"西藏自治区",
            26=>"陕西省",
            27=>"甘肃省",
            28=>"青海省",
            29=>"宁夏回族自治区",
            30=>"新疆维吾尔自治区",
            31=>"台湾",
            32=>"香港",
            33=>"澳门",
            35=>"市辖区",
            36=>"市辖区",
            37=>"石家庄市",
            38=>"唐山市",
            39=>"秦皇岛市",
            40=>"邯郸市",
            41=>"邢台市",
            42=>"保定市",
            43=>"张家口市",
            44=>"承德市",
            45=>"沧州市",
            46=>"廊坊市",
            47=>"衡水市",
            48=>"太原市",
            49=>"大同市",
            50=>"阳泉市",
            51=>"长治市",
            52=>"晋城市",
            53=>"朔州市",
            54=>"晋中市",
            55=>"运城市",
            56=>"忻州市",
            57=>"临汾市",
            58=>"吕梁市",
            59=>"呼和浩特市",
            60=>"包头市",
            61=>"乌海市",
            62=>"赤峰市",
            63=>"通辽市",
            64=>"鄂尔多斯市",
            65=>"呼伦贝尔市",
            66=>"巴彦淖尔市",
            67=>"乌兰察布市",
            68=>"兴安盟",
            69=>"锡林郭勒盟",
            70=>"阿拉善盟",
            71=>"沈阳市",
            72=>"大连市",
            73=>"鞍山市",
            74=>"抚顺市",
            75=>"本溪市",
            76=>"丹东市",
            77=>"锦州市",
            78=>"营口市",
            79=>"阜新市",
            80=>"辽阳市",
            81=>"盘锦市",
            82=>"铁岭市",
            83=>"朝阳市",
            84=>"葫芦岛市",
            85=>"长春市",
            86=>"吉林市",
            87=>"四平市",
            88=>"辽源市",
            89=>"通化市",
            90=>"白山市",
            91=>"松原市",
            92=>"白城市",
            93=>"延边朝鲜族自治州",
            94=>"哈尔滨市",
            95=>"齐齐哈尔市",
            96=>"鸡西市",
            97=>"鹤岗市",
            98=>"双鸭山市",
            99=>"大庆市",
            100=>"伊春市",
            101=>"佳木斯市",
            102=>"七台河市",
            103=>"牡丹江市",
            104=>"黑河市",
            105=>"绥化市",
            106=>"大兴安岭地区",
            107=>"市辖区",
            108=>"南京市",
            109=>"无锡市",
            110=>"徐州市",
            111=>"常州市",
            112=>"苏州市",
            113=>"南通市",
            114=>"连云港市",
            115=>"淮安市",
            116=>"盐城市",
            117=>"扬州市",
            118=>"镇江市",
            119=>"泰州市",
            120=>"宿迁市",
            121=>"杭州市",
            122=>"宁波市",
            123=>"温州市",
            124=>"嘉兴市",
            125=>"湖州市",
            126=>"绍兴市",
            127=>"金华市",
            128=>"衢州市",
            129=>"舟山市",
            130=>"台州市",
            131=>"丽水市",
            132=>"合肥市",
            133=>"芜湖市",
            134=>"蚌埠市",
            135=>"淮南市",
            136=>"马鞍山市",
            137=>"淮北市",
            138=>"铜陵市",
            139=>"安庆市",
            140=>"黄山市",
            141=>"滁州市",
            142=>"阜阳市",
            143=>"宿州市",
            144=>"六安市",
            145=>"亳州市",
            146=>"池州市",
            147=>"宣城市",
            148=>"福州市",
            149=>"厦门市",
            150=>"莆田市",
            151=>"三明市",
            152=>"泉州市",
            153=>"漳州市",
            154=>"南平市",
            155=>"龙岩市",
            156=>"宁德市",
            157=>"南昌市",
            158=>"景德镇市",
            159=>"萍乡市",
            160=>"九江市",
            161=>"新余市",
            162=>"鹰潭市",
            163=>"赣州市",
            164=>"吉安市",
            165=>"宜春市",
            166=>"抚州市",
            167=>"上饶市",
            168=>"济南市",
            169=>"青岛市",
            170=>"淄博市",
            171=>"枣庄市",
            172=>"东营市",
            173=>"烟台市",
            174=>"潍坊市",
            175=>"济宁市",
            176=>"泰安市",
            177=>"威海市",
            178=>"日照市",
            179=>"莱芜市",
            180=>"临沂市",
            181=>"德州市",
            182=>"聊城市",
            183=>"滨州市",
            184=>"菏泽市",
            185=>"郑州市",
            186=>"开封市",
            187=>"洛阳市",
            188=>"平顶山市",
            189=>"安阳市",
            190=>"鹤壁市",
            191=>"新乡市",
            192=>"焦作市",
            193=>"濮阳市",
            194=>"许昌市",
            195=>"漯河市",
            196=>"三门峡市",
            197=>"南阳市",
            198=>"商丘市",
            199=>"信阳市",
            200=>"周口市",
            201=>"驻马店市",
            202=>"省直辖县级行政区划",
            203=>"武汉市",
            204=>"黄石市",
            205=>"十堰市",
            206=>"宜昌市",
            207=>"襄阳市",
            208=>"鄂州市",
            209=>"荆门市",
            210=>"孝感市",
            211=>"荆州市",
            212=>"黄冈市",
            213=>"咸宁市",
            214=>"随州市",
            215=>"恩施土家族苗族自治州",
            216=>"省直辖县级行政区划",
            217=>"长沙市",
            218=>"株洲市",
            219=>"湘潭市",
            220=>"衡阳市",
            221=>"邵阳市",
            222=>"岳阳市",
            223=>"常德市",
            224=>"张家界市",
            225=>"益阳市",
            226=>"郴州市",
            227=>"永州市",
            228=>"怀化市",
            229=>"娄底市",
            230=>"湘西土家族苗族自治州",
            231=>"广州市",
            232=>"韶关市",
            233=>"深圳市",
            234=>"珠海市",
            235=>"汕头市",
            236=>"佛山市",
            237=>"江门市",
            238=>"湛江市",
            239=>"茂名市",
            240=>"肇庆市",
            241=>"惠州市",
            242=>"梅州市",
            243=>"汕尾市",
            244=>"河源市",
            245=>"阳江市",
            246=>"清远市",
            247=>"东莞市",
            248=>"中山市",
            249=>"潮州市",
            250=>"揭阳市",
            251=>"云浮市",
            252=>"南宁市",
            253=>"柳州市",
            254=>"桂林市",
            255=>"梧州市",
            256=>"北海市",
            257=>"防城港市",
            258=>"钦州市",
            259=>"贵港市",
            260=>"玉林市",
            261=>"百色市",
            262=>"贺州市",
            263=>"河池市",
            264=>"来宾市",
            265=>"崇左市",
            266=>"海口市",
            267=>"三亚市",
            268=>"三沙市",
            269=>"儋州市",
            270=>"省直辖县级行政区划",
            271=>"市辖区",
            272=>"县",
            273=>"成都市",
            274=>"自贡市",
            275=>"攀枝花市",
            276=>"泸州市",
            277=>"德阳市",
            278=>"绵阳市",
            279=>"广元市",
            280=>"遂宁市",
            281=>"内江市",
            282=>"乐山市",
            283=>"南充市",
            284=>"眉山市",
            285=>"宜宾市",
            286=>"广安市",
            287=>"达州市",
            288=>"雅安市",
            289=>"巴中市",
            290=>"资阳市",
            291=>"阿坝藏族羌族自治州",
            292=>"甘孜藏族自治州",
            293=>"凉山彝族自治州",
            294=>"贵阳市",
            295=>"六盘水市",
            296=>"遵义市",
            297=>"安顺市",
            298=>"毕节市",
            299=>"铜仁市",
            300=>"黔西南布依族苗族自治州",
            301=>"黔东南苗族侗族自治州",
            302=>"黔南布依族苗族自治州",
            303=>"昆明市",
            304=>"曲靖市",
            305=>"玉溪市",
            306=>"保山市",
            307=>"昭通市",
            308=>"丽江市",
            309=>"普洱市",
            310=>"临沧市",
            311=>"楚雄彝族自治州",
            312=>"红河哈尼族彝族自治州",
            313=>"文山壮族苗族自治州",
            314=>"西双版纳傣族自治州",
            315=>"大理白族自治州",
            316=>"德宏傣族景颇族自治州",
            317=>"怒江傈僳族自治州",
            318=>"迪庆藏族自治州",
            319=>"拉萨市",
            320=>"日喀则市",
            321=>"昌都市",
            322=>"林芝市",
            323=>"山南市",
            324=>"那曲地区",
            325=>"阿里地区",
            326=>"西安市",
            327=>"铜川市",
            328=>"宝鸡市",
            329=>"咸阳市",
            330=>"渭南市",
            331=>"延安市",
            332=>"汉中市",
            333=>"榆林市",
            334=>"安康市",
            335=>"商洛市",
            336=>"兰州市",
            337=>"嘉峪关市",
            338=>"金昌市",
            339=>"白银市",
            340=>"天水市",
            341=>"武威市",
            342=>"张掖市",
            343=>"平凉市",
            344=>"酒泉市",
            345=>"庆阳市",
            346=>"定西市",
            347=>"陇南市",
            348=>"临夏回族自治州",
            349=>"甘南藏族自治州",
            350=>"西宁市",
            351=>"海东市",
            352=>"海北藏族自治州",
            353=>"黄南藏族自治州",
            354=>"海南藏族自治州",
            355=>"果洛藏族自治州",
            356=>"玉树藏族自治州",
            357=>"海西蒙古族藏族自治州",
            358=>"银川市",
            359=>"石嘴山市",
            360=>"吴忠市",
            361=>"固原市",
            362=>"中卫市",
            363=>"乌鲁木齐市",
            364=>"克拉玛依市",
            365=>"吐鲁番市",
            366=>"哈密市",
            367=>"昌吉回族自治州",
            368=>"博尔塔拉蒙古自治州",
            369=>"巴音郭楞蒙古自治州",
            370=>"阿克苏地区",
            371=>"克孜勒苏柯尔克孜自治州",
            372=>"喀什地区",
            373=>"和田地区",
            374=>"伊犁哈萨克自治州",
            375=>"塔城地区",
            376=>"阿勒泰地区",
            377=>"自治区直辖县级行政区划",
            378=>"台北",
            379=>"高雄",
            380=>"基隆",
            381=>"台中",
            382=>"台南",
            383=>"新竹",
            384=>"嘉义",
            385=>"宜兰",
            386=>"桃园",
            387=>"苗栗",
            388=>"彰化",
            389=>"南投",
            390=>"云林",
            391=>"屏东",
            392=>"台东",
            393=>"花莲",
            394=>"澎湖",
            395=>"香港岛",
            396=>"九龙",
            397=>"新界",
            398=>"澳门半岛",
            399=>"氹仔岛",
            400=>"路环岛",
            401=>"路氹城",
        ];
        $array =[
            0=>"市辖区",
            1=>"市辖区",
            2=>"石家庄市 唐山市 秦皇岛市 邯郸市 邢台市 保定市 张家口市 承德市 沧州市 廊坊市 衡水市",
            3=>"太原市 大同市 阳泉市 长治市 晋城市 朔州市 晋中市 运城市 忻州市 临汾市 吕梁市",
            4=>"呼和浩特市 包头市 乌海市 赤峰市 通辽市 鄂尔多斯市 呼伦贝尔市 巴彦淖尔市 乌兰察布市 兴安盟 锡林郭勒盟 阿拉善盟",
            5=>"沈阳市 大连市 鞍山市 抚顺市 本溪市 丹东市 锦州市 营口市 阜新市 辽阳市 盘锦市 铁岭市 朝阳市 葫芦岛市",
            6=>"长春市 吉林市 四平市 辽源市 通化市 白山市 松原市 白城市 延边朝鲜族自治州",
            7=>"哈尔滨市 齐齐哈尔市 鸡西市 鹤岗市 双鸭山市 大庆市 伊春市 佳木斯市 七台河市 牡丹江市 黑河市 绥化市 大兴安岭地区",
            8=>"市辖区",
            9=>"南京市 无锡市 徐州市 常州市 苏州市 南通市 连云港市 淮安市 盐城市 扬州市 镇江市 泰州市 宿迁市",
            10=>"杭州市 宁波市 温州市 嘉兴市 湖州市 绍兴市 金华市 衢州市 舟山市 台州市 丽水市",
            11=>"合肥市 芜湖市 蚌埠市 淮南市 马鞍山市 淮北市 铜陵市 安庆市 黄山市 滁州市 阜阳市 宿州市 六安市 亳州市 池州市 宣城市",
            12=>"福州市 厦门市 莆田市 三明市 泉州市 漳州市 南平市 龙岩市 宁德市",
            13=>"南昌市 景德镇市 萍乡市 九江市 新余市 鹰潭市 赣州市 吉安市 宜春市 抚州市 上饶市",
            14=>"济南市 青岛市 淄博市 枣庄市 东营市 烟台市 潍坊市 济宁市 泰安市 威海市 日照市 莱芜市 临沂市 德州市 聊城市 滨州市 菏泽市",
            15=>"郑州市 开封市 洛阳市 平顶山市 安阳市 鹤壁市 新乡市 焦作市 濮阳市 许昌市 漯河市 三门峡市 南阳市 商丘市 信阳市 周口市 驻马店市 省直辖县级行政区划",
            16=>"武汉市 黄石市 十堰市 宜昌市 襄阳市 鄂州市 荆门市 孝感市 荆州市 黄冈市 咸宁市 随州市 恩施土家族苗族自治州 省直辖县级行政区划",
            17=>"长沙市 株洲市 湘潭市 衡阳市 邵阳市 岳阳市 常德市 张家界市 益阳市 郴州市 永州市 怀化市 娄底市 湘西土家族苗族自治州",
            18=>"广州市 韶关市 深圳市 珠海市 汕头市 佛山市 江门市 湛江市 茂名市 肇庆市 惠州市 梅州市 汕尾市 河源市 阳江市 清远市 东莞市 中山市 潮州市 揭阳市 云浮市",
            19=>"南宁市 柳州市 桂林市 梧州市 北海市 防城港市 钦州市 贵港市 玉林市 百色市 贺州市 河池市 来宾市 崇左市",
            20=>"海口市 三亚市 三沙市 儋州市 省直辖县级行政区划",
            21=>"市辖区 县",
            22=>"成都市 自贡市 攀枝花市 泸州市 德阳市 绵阳市 广元市 遂宁市 内江市 乐山市 南充市 眉山市 宜宾市 广安市 达州市 雅安市 巴中市 资阳市 阿坝藏族羌族自治州 甘孜藏族自治州 凉山彝族自治州",
            23=>"贵阳市 六盘水市 遵义市 安顺市 毕节市 铜仁市 黔西南布依族苗族自治州 黔东南苗族侗族自治州 黔南布依族苗族自治州",
            24=>"昆明市 曲靖市 玉溪市 保山市 昭通市 丽江市 普洱市 临沧市 楚雄彝族自治州 红河哈尼族彝族自治州 文山壮族苗族自治州 西双版纳傣族自治州 大理白族自治州 德宏傣族景颇族自治州 怒江傈僳族自治州 迪庆藏族自治州",
            25=>"拉萨市 日喀则市 昌都市 林芝市 山南市 那曲地区 阿里地区",
            26=>"西安市 铜川市 宝鸡市 咸阳市 渭南市 延安市 汉中市 榆林市 安康市 商洛市",
            27=>"兰州市 嘉峪关市 金昌市 白银市 天水市 武威市 张掖市 平凉市 酒泉市 庆阳市 定西市 陇南市 临夏回族自治州 甘南藏族自治州",
            28=>"西宁市 海东市 海北藏族自治州 黄南藏族自治州 海南藏族自治州 果洛藏族自治州 玉树藏族自治州 海西蒙古族藏族自治州",
            29=>"银川市 石嘴山市 吴忠市 固原市 中卫市",
            30=>"乌鲁木齐市 克拉玛依市 吐鲁番市 哈密市 昌吉回族自治州 博尔塔拉蒙古自治州 巴音郭楞蒙古自治州 阿克苏地区 克孜勒苏柯尔克孜自治州 喀什地区 和田地区 伊犁哈萨克自治州 塔城地区 阿勒泰地区 自治区直辖县级行政区划",
            31=>"台北 高雄 基隆 台中 台南 新竹 嘉义 宜兰 桃园 苗栗 彰化 南投 云林 屏东 台东 花莲 澎湖",
            32=>"香港岛 九龙 新界",
            33=>"澳门半岛 氹仔岛 路环岛 路氹城",
        ];



        $count = 35;
        foreach($array as $k=>$v){
            $a = explode(' ',$v);

            $html = '';
            foreach($a as $key=>$value){
                $html .= $count.'=>"'.$arrays[$count].'",';
                $count++;
            }
//            foreach($a as $key=>$value){
//                echo $count .'=>"'.$value.'",';
//                echo "</br>";
//                $count++;
//            }
            $html= substr($html, 0, -1);
            echo '"'.$arrays[$k].'"'.'=>['.$html.'],';
            echo "<br/>";

        }
        dd(1);
        $friend = $this->friend->LowerLevelOne(61);

        $number = [];
        if($friend){
            foreach($friend as $k=>$v){
                dump($v);
                if($v->is_delivery == 1){
                    dump('给他发送');
                    $user = $this->user->find($v->parent_id);
                    if($user && !empty($user->phone_number)){
                        $number[] = $user->phone_number;

                    }
                }
            }
            if($number){
                $new_number = array_unique($number);
                dd($number,1,$new_number);
            }

        }
        dd($number);

        $select = ['user_nickname','user_img','sex','created_at'];
        $user_id = 2;
        $lower = $this->friend->LowerLevel($user_id);

        $lower = array_values(self::array_unset_tt($lower,'parent_id'));

        foreach($lower as $k=>$v){
            if($v['user_id'] == 0){
                unset($lower[$k]);
            }else{
                $lower[$k]['user_info'] = $this->user->select($select)->find($v['user_id']);
                $lower[$k]['created_at'] = $lower[$k]['user_info']->created_at;
                $lower[$k]['count'] = $this->friend->LowerCount($v['user_id']);
                $current = $this->friend->CurrentLevel($v['user_id']);
                $agent = $this->agent->getByUserID($v['user_id'],1);
                if($agent){
                    $lower[$k]['user_status'] = 1;
                }else{
                    $lower[$k]['user_status'] = isset($current['status'])?$current['status']:0;
                }
                $lower[$k]['is_delivery'] = isset($current['is_delivery'])?$current['is_delivery']:0;

                $lower[$k]['contribution_amount'] = $this->friend->Contribution($v['user_id'],$user_id);
            }

        }


        dd($lower);
        $lng = '39.984154';
        $lat = '116.307490';
       $result = MapServices::get_address($lng,$lat);
       dd($result);



        $a = "1,概况,home,index/default,0,statistics,0,1
2,会员,set,member/index,0,member,0,1
3,订单,template,order/index,0,order,0,1
4,商品,component,label/index,0,label,0,1
5,推荐,app,recommend/index,0,recommend,0,1
6,设置,unlink,config/index,0,setup,0,1
7,详细概况,,index/default,1,statistics.list,0,1
8,会员列表,,member/index,2,member.list,0,1
9,订单列,,order/order,3,order.list,0,1
10,推荐列表,,recommend/index,5,recommend.list,0,1
11,程序配置,,config/index,6,setup.list,0,1
12,商品类型,,label/index,4,label.list,0,1
13,代理,notice,agent/index,0,agent,0,1
30,地址,voice,address/index,0,comment,0,1
31,地址管理,,address/index,30,address.list,0,1
32,权限管理,notice,admin/admin,0,admin,0,1
33,管理员,,admin/admin,32,admin.list,0,1
37,商品列表,,goods/index,4,label.destination,0,1
39,关于,about,about/about,0,about.about,0,1
40,关于,,about/about,39,about.about,0,1
42,代理审核,,agent/index,13,agent.index,0,1
43,提现,notice,withdraw/index,0,withdraw.index,0,1
44,提现记录,,withdraw/index,43,withdraw.index,0,1";
        $b = explode("\n",$a);
        $datas = [];
        $data = [];
        foreach($b as $k=>$v){

            echo '[';
            echo "<br/>";
            echo "'id'=>'".explode(',',$v)[0]."',";echo "<br/>";
            echo "'menuname'=>'".explode(',',$v)[1]."',";echo "<br/>";
            echo "'icon'=>'".explode(',',$v)[2]."',";echo "<br/>";
            echo "'url'=>'".explode(',',$v)[3]."',";echo "<br/>";
            echo "'pid'=>'".explode(',',$v)[4]."',";echo "<br/>";
            echo "'rout'=>'".explode(',',$v)[5]."',";echo "<br/>";
            echo "'time'=>'".explode(',',$v)[6]."',";echo "<br/>";
            echo "'status'=>'".explode(',',$v)[7]."',";echo "<br/>";
            echo '],';echo "<br/>";
        }

        dd(1);
        $asset  = new Asset();
        $income  = new IncomeDetails();

        $amount = $income->getAmount(1);
        if($amount){
            dd('有');
        }else{
            dd('没');
        }
//        $sum = $asset->sum('royalty_balance');
        dd($amount,$amount == null);
        $collect = new Agent();

        $all =[
            "user_name"=>"杰大哥",
            "iphone"=>"17880952663",
            "city"=>"四川省成都市新都区",
            "address"=>"斑竹园",
            "user_id"=>1,
            "lng"=>104.061378,
            "lat"=>30.81497
        ];
        $user_id = 1;
        $result = $collect->insertAgent($all,$user_id);
        dd($result);
//        $goods = new Goods();
//
//        $goods->updateStock(9,2,1);
//        dd(1);
        return   $this->response( $this->initResponse());
    }
}